#define TC 0 // 도
#define TD 1 // 레
#define TE 2 // 미
#define TF 3 // 파
#define TG 4 // 솔
#define TA 5 // 라
#define TB 6 // 시
#define TX 7

int fq[]={262,294,330,349,392,440,494,0}; // 음계 주파수(Hz) 도레미...
// 멜로디 배열 데이터 mo: 도레미송
int mo[45][2]={{TC,500},{TD,500},{TE,1000},{TX,1000}, {TC,500},{ TD,500}, {TE,1000},{TX,1000},
            {TG,500},{TE,500},{TD,500}, {TC,500},{ TD,500}, {TE,500},{TD,1000},{TX,1000},
            {TC,500},{TD,500},{TE,1000}, {TX,1000},{TC,500},{ TD,500}, {TE,1000},{TX,1000},
            {TG,500},{TE,500},{TD,500}, {TC,500},{ TD,500}, {TE,500},{TC,1000},{TX,1000},
            {TG,500},{TG,500},{TE,500},{TG,500},{TA,500},{TA,500},{TG,1000},{TX,1000},
            {TE,500},{TE,500},{TD,500},{TD,500},{TC,1000}};
void setup() {
 for(int i=0; i<45; i++){
   tone(12,fq[mo[i][0]],mo[i][1]); // 멜로디 배열 데이터 mo를 연주
   delay(500);
 }
}
void loop() { }

